In [2]:
# Import necessary packages
import pandas as pd
import numpy as np
airbnb_price_csv = pd.read_csv('/Users/mac/Downloads/data/airbnb_price.csv')
airbnb_room_type = pd.read_excel('/Users/mac/Downloads/data/airbnb_room_type.xlsx')
airbnb_last_review = pd.read_csv('/Users/mac/Downloads/data/airbnb_last_review.tsv', sep='\t')

df_price = pd.DataFrame(airbnb_price_csv)
df_room = pd.DataFrame(airbnb_room_type)
df_last = pd.DataFrame(airbnb_last_review)

#previewing the dataframes
df_price.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [3]:
df_room.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [4]:
df_last.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [5]:
#Merging the dataframes into one 

listing = pd.merge(airbnb_price_csv, airbnb_room_type, on = 'listing_id')
listing = pd.merge(listing, airbnb_last_review, on= 'listing_id')
listing.tail()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
25204,36425863,129 dollars,"Manhattan, Upper East Side",Lovely Privet Bedroom with Privet Restroom,PRIVATE ROOM,Rusaa,July 07 2019
25205,36427429,45 dollars,"Queens, Flushing",No.2 with queen size bed,PRIVATE ROOM,Hâ€†Ai,July 07 2019
25206,36438336,235 dollars,"Staten Island, Great Kills",Seas The Moment,Private room,Ben,July 07 2019
25207,36442252,100 dollars,"Bronx, Mott Haven",1B-1B apartment near by Metro,Entire home/apt,Blaine,July 07 2019
25208,36455809,30 dollars,"Brooklyn, Bushwick","Cozy Private Room in Bushwick, Brooklyn",Private room,Christine,July 08 2019

In [7]:
#formatting the last_review column to datetime type

listing['last_review_date'] = pd.to_datetime(listing['last_review'], format='%B %d %Y')
listing['last_review_date'].head()

0   2019-05-21
1   2019-07-05
2   2019-06-22
3   2019-06-24
4   2019-06-09
Name: last_review_date, dtype: datetime64[ns]

In [9]:
#the first and last reviewed 
first_reviewed = listing['last_review_date'].min()
last_reviewed = listing['last_review_date'].max()

In [17]:
listing['room_type'] = listing['room_type'].str.lower() #making it uniform
no_private_rooms = listing[listing['room_type'] == 'private room'].shape[0]
no_entire_home = listing[listing['room_type'] == 'entire home/apt'].shape[0]
print(f' Private room :{no_private_rooms},  Entire apartments: {no_entire_home}')

 Private room :11356,  Entire apartments: 13266

In [18]:
#the average listing price 
listing['price_clean'] = listing['price'].str.replace('dollars','').astype(float)
average_price = listing['price_clean'].mean()

In [20]:
review_dates = pd.DataFrame({
    'first_reviewed' :[first_reviewed],
    'last_reviewed': [last_reviewed],
    'no_private_rooms':[no_private_rooms],
    'no_entire_apartments':[no_entire_home],
    'average_price': [round(average_price, 2)]
})

review_dates.head()

,first_reviewed,last_reviewed,no_private_rooms,no_entire_apartments,average_price
0,2019-01-01,2019-07-09,11356,13266,141.78